import re as r
s = "a bb ccc"

res = r.findall("[abc]", s)
print(res)

"""
Основне завдання:
Розробити скрипт, який рахує кількість слів у введеному тексті.
Розробити скрипт, який буде отримувати номер авто та визначати валідність номеру та регіон реєстрації. Номера, що можуть бути введені відповідають поточному українському законодавству (лише стандартні номери, номери на замовлення не використовуємо). Використайте лише 3 регіони реєстрації України.

Розробити скрипт, який буде отримувати текст і виводити у консоль всі e-mail, які знаходяться в тексті. Для визначення e-mail, слід використати стандарт RFC 5322.

Розробіть скрипт, який буде порівнювати пароль, що вводить користувач з шаблоном, зашитим у коді. При цьому порівняння не повинно враховувати регістр, пробіли та всі інші розділові знаки, крім дефісу.

Розробіть скрипт, який буде брати перші літери кожного слова та створювати з нього абревіатуру (н-д, НАСА, ЗВО і т.д.). Чим абревіатура відрізняється від акроніму та акровірша?

Хайку - жанр традиційної японської ліричної поезії століття, відомий з XIV століття. Оригінальне японське хайку складається з 17 складів, що становлять один стовпець ієрогліфів. Особливими розділовими словами - кіредзі - текст хайку розділяється на частини з 5, 7 і знову 5 складів. При перекладі хайку на західні мови традиційно замість розділового слова використовують розрив рядка і, таким чином, хайку записуються як тривіршів.
Перед вами тривірші, які претендують на те, щоб бути хайку. Як роздільник рядків використовуються символи "/". Якщо роздільники ділять текст на рядки, в яких 5/7/5 складів, то виведіть «Хайку!». Якщо число рядків не дорівнює 3, то виведіть рядок «Не хайку. Повинно бути 3 рядки.» Інакше виведіть рядок виду «Не хайку. В i рядку складів не s, а j.», Де рядок i - перший рядок, в якому кількість складів неправильна.
Для простоти будемо вважати, що кількість складів дорівнює кількості голосних.
Ще не померла! / Закінчується осінь, / Я йду за обрій. - Хайку!
Ночую просто неба. / Виє пес. / Теж допекла, мабýть, осіння мряка! - Не хайку! У першому рядку 7 складів замість 5.
Вода замерзла, / Розколовши глечик. / І тріск раптовий розбудив мене. - Не хайку! У другому рядку 6 складів замість 7.

Дуже поширена помилка помилка - це повторення слів.
Так, у попередньому реченні така помилка була допущена. Необхідно виправити кожне таке повторення слів. Контрольний текст:
"Дуже поширена помилка помилка - це лише повторення повторення слова слова. Смішно, чи чи не так? Це - книга книгарні."

 Великі числа зручно читати, якщо їхні цифри розділені комами на трійки. Розробіть скрипт, який отримує текст і в кожному числі, яке є в тексті, додає коми де потрібно.

Напишіть скрипт, який буде отримувати текст і переформатує його таким чином, щоб кожне речення займало лише один рядок. Для простоти вважатимемо, що
- кожне речення починається з великої кириличної або латинської літери;
- кожне речення закінчується одним з роздільних знаків ".;!?"
- між реченнями можуть знаходитись будь-яка кількість пробільних символів;
- в середині тексту відсутні великих букв та крапок;
- порожніх рядків у виводі не повинно бути;
- будь-які набори з більш, ніж одного пробільного символу замінюйте на один пробіл.
Контрольний текст:
"В        цьому
реченні розриви рядків... Але це
не так важливо! Зовсім? Так, зовсім! І це не повинно   заважати."
Вивід:
"В цьому реченні розриви рядків...
Але це не так важливо!
Зовсім?
Так, зовсім!
І це не повинно заважати."

Ускладнене завдання:
Виконати основне завдання 1 у один рядок.

(не активно) Вовочка підготував дуже важливий лист, однак скрізь вказав неправильний час. Тому потрібно замінити всі входження часу на текстовий рядок (TBD). Час - це рядок виду HH:MM:SS або HH:MM, у якій HH — число від 00 до 23, а MM та SS — число від 00 до 59.

(не активно) Вольдемар мав швидко заплутати фінансову документацію (це в нього зі школи). Але так, щоб можна було відновити дані. Він не придумав нічого кращого, аніж замінити кожен символ на його байтове значення, піднесене до кубу. Реалізуйте таку програму.

Виконати основне завдання 5 у один рядок.
"""